{
    "name":  "Corporate EDR Policy",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "templateReference":  {
                              "templateId":  "0385b795-0f2f-44ac-8602-9f65bf6adede_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "23ab0ea3-1b12-429a-8ed0-7390cf699160"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "e5c7c98c-c854-4140-836e-bd22db59d651",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "d3091bf4-e7ca-488e-8eaa-b4ea2c7ec4f3",
                                                                                                                            "valueState":  "encryptedValueToken"
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "6998c81e-2814-4f5e-b492-a6159128a97b"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f72c326c-7c5b-4224-b890-0b9b54522bd9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "03de6095-07c4-4f35-be38-c1cd3bae4484"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "350b0bea-b67b-43d4-9a04-c796edb961fd",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
