{
    "name":  "Windows 10 - Set TimeZone to EST",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_sensors_disablelocation_1",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_sensors_disablelocation_1_0",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_sensors_disablelocationscripting_1",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_sensors_disablelocationscripting_1_0",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_sensors_disablesensors_1",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "user_vendor_msft_policy_config_admx_sensors_disablesensors_1_0",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1_0",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_settings_allowdatetime",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_settings_allowdatetime_1",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_timelanguagesettings_configuretimezone",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "Eastern Standard Time"
                                                                        }
                                             }
                     }
                 ]
}
