{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "195c53cd-1e25-42b5-ad29-78c2fd4c9f70",
    "lastModifiedDateTime":  "2023-03-14T21:06:18.4897875Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2023-03-14T18:05:21.8192322Z",
    "description":  "",
    "displayName":  "Windows - Azure VPN Connection Profile Configuration",
    "version":  2,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingStringXml",
                            "displayName":  "Deploy Azure VPN Profile",
                            "description":  null,
                            "omaUri":  "./User/Vendor/MSFT/VPNv2/3G Capital Azure Network/ProfileXML",
                            "secretReferenceValueId":  "806901f4-4466-46ca-94cc-4c36221bcf77_195c53cd-1e25-42b5-ad29-78c2fd4c9f70_d2df2f86-a440-4791-b73e-eaa4ee60c38f",
                            "isEncrypted":  true,
                            "fileName":  "VPNProfile.xml",
                            "value":  "PGEvPg=="
                        }
                    ]
}
