{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "a5ee2b38-6a2f-43f6-a105-af67880b961a",
    "lastModifiedDateTime":  "2021-12-01T15:57:50.4141636Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-12-01T15:57:50.4141636Z",
    "description":  null,
    "displayName":  "Windows 10 - Allow Azure AD Password Reset",
    "version":  1,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Allow Azure AD Password Reset",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/Authentication/AllowAadPasswordReset",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        }
                    ]
}
