{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "5ec2017b-5180-4927-ae01-3277fcc6ce53",
    "lastModifiedDateTime":  "2022-04-28T14:02:39.8103922Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2022-04-28T14:02:39.8103922Z",
    "description":  null,
    "displayName":  "Windows 10 - Allow Removable Storage",
    "version":  1,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Allow Removable Storage",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/System/AllowStorageCard",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        }
                    ]
}
