{
    "@odata.type":  "#microsoft.graph.androidWorkProfileCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "0e5cde7f-74a1-497d-8312-70894550a56f",
    "createdDateTime":  "2022-11-11T15:33:07.1074383Z",
    "description":  "The Android Enterprise Personally-owned work profile creates a separate partition at the Android OS level that can be managed by Intune.",
    "lastModifiedDateTime":  "2022-11-11T15:33:07.1074383Z",
    "displayName":  "Android - Corporate BYOD Compliance Policy",
    "version":  1,
    "passwordRequired":  true,
    "passwordMinimumLength":  6,
    "passwordRequiredType":  "numeric",
    "requiredPasswordComplexity":  "none",
    "passwordMinutesOfInactivityBeforeLock":  5,
    "passwordExpirationDays":  365,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  false,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  "8",
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  false,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  false,
    "securityRequiredAndroidSafetyNetEvaluationType":  "basic"
}
