{
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "907a1163-c57f-4904-8805-2c93c8b60a86",
    "createdDateTime":  "2019-07-29T21:08:58.7999229Z",
    "description":  "Default Windows 10 Compliance Policy",
    "lastModifiedDateTime":  "2022-11-01T16:40:31.4674587Z",
    "displayName":  "Windows 10 - Default Company Policy",
    "version":  20,
    "passwordRequired":  true,
    "passwordBlockSimple":  true,
    "passwordRequiredToUnlockFromIdle":  true,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "passwordPreviousPasswordBlockCount":  null,
    "requireHealthyDeviceReport":  false,
    "osMinimumVersion":  "10.0.19041.329",
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  false,
    "secureBootEnabled":  false,
    "codeIntegrityEnabled":  false,
    "memoryIntegrityEnabled":  false,
    "kernelDmaProtectionEnabled":  false,
    "virtualizationBasedSecurityEnabled":  false,
    "firmwareProtectionEnabled":  false,
    "storageRequireEncryption":  false,
    "activeFirewallRequired":  true,
    "defenderEnabled":  false,
    "defenderVersion":  null,
    "signatureOutOfDate":  false,
    "rtpEnabled":  false,
    "antivirusRequired":  true,
    "antiSpywareRequired":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  false,
    "deviceCompliancePolicyScript":  null,
    "validOperatingSystemBuildRanges":  [

                                        ]
}
